Model Summary for the network found in the create_model function in model.py
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cropping2d_1 (Cropping2D)    (None, 90, 320, 3)        0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 90, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 86, 316, 24)       1824      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 43, 158, 24)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 39, 154, 36)       21636     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 19, 77, 36)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 17, 75, 48)        15600     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 17, 37, 48)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 15, 35, 64)        27712     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 7, 17, 64)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 5, 15, 64)         36928     
_________________________________________________________________
dropout_1 (Dropout)          (None, 5, 15, 64)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4800)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               480100    
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050      
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510       
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11        
=================================================================
Total params: 589,371
Trainable params: 589,371
Non-trainable params: 0
_________________________________________________________________
